{
    "home": {
        "figure": "<img src='img/hikingchallenge2.png' alt='Let's get some good shots.' class='flexible-image' />",
        "introduction": "<h1 class='center'>CMLC Hiking Challenge 2</h1><h2 class='center'>Explore. Discover. Preserve.</h2><p class='center'><strong>What You Do:</strong> Complete 8 Hikes<br /><strong>What you Get: </strong>Hiking Patch, Free Hiking Gear<br /><strong>Why You Should Do It: </strong>Have Fun, Support Land Conservation</p><p>Completers of the eight hikes will earn our unique white squirrel-themed embroidered hiking patch, a certificate of completion, recognition in our online and print publications, and a $20 gift certificate for hiking gear at Hendersonville's Mast General Store.</p>"
    },
    "trails": {
        "bearwallow": {
            "name": "Bearwallow Mountain Trail",
            "id": "bearwallow",
            "linkName": "Bearwallow Mountain",
            "latitude": "35.4607",
            "longitude": "-82.3681",
            "trailImage": "bearwallowvista.png",
            "mapImage": "bearwallowmap.png",
            "hikeDescription": "<p>At 4,232 ft. above sea level, Bearwallow Mountain stands as the highest peak in the widely-visible Bearwallow Highlands range.  Straddling the Eastern Continental Divide, it makes up part of the Blue Ridge Escarpment as well as the western rim of the Hickory Nut Gorge. Crowned with a grassy meadow at its summit, the mountain features a nearly 360 degree view that encompasses some of the southern Appalachians highest peaks including Mt. Mitchell in the Black Mountains and Mt. Pisgah in the Great Balsams range.  Its breathtaking vista also includes a birds-eye view of Hickory Nut Gorge, downtown Hendersonville, and the lowlands of South Carolina. A historic fire lookout tower occupies the summit, as do grazing cattle who call the mountaintop home.</p> <p>CMLC constructed this new trail with the help of the Carolina Mountain Club, REI, and community volunteers. This trail will one day be incorporated into the Upper Hickory Nut Gorge Trail, a loop that will link Bearwallow Mountain to CMLC’s Florence Preserve and the conserved summit of Ferguson Peak.</p> <p>CMLC acquired a conservation easement on 81 acres at the summit of Bearwallow in 2009, forever protecting it from mountaintop development. We are currently working toward the total conservation of more than 480 acres at Bearwallow Mountain.</p>",
            "hikeChallenge": "<h3>CHALLENGE: Hike to the top of Bearwallow Mountain</h3><strong>Primary Route:</strong> Hike the newly opened Bearwallow Mountain Trail to the scenic mountain summit<br /> <strong>Hiking Distance:</strong> 2.0 miles round-trip<br /> <strong>Elevation Gain:</strong> 537 feet<br /> <strong>Difficulty:</strong> Strenuous",
            "trailheadDescription": "<p><strong>Trailhead:</strong> Trailhead is at the crest of Bearwallow Mountain Rd. where the pavement turns to gravel. Once at the trailhead, park on the shoulder of the road making sure not to block the gate or the road. Space is available for only a few cars at this trailhead, so multiple hikers should consider carpooling. Trail begins beyond an old, rusted gate; walk around it and look for the beginning of the trail on the right.  </p>",
            "hikingDirections": "<p><strong>Hiking Directions:</strong> Once inside the gate, locate the trail to the right of the gravel road. The trail switchbacks several times to begin its climb upon entering the forest. At <strong>0.4 mi.</strong>, ascend a set of elaborate, switchbacked rock stairs constructed by the Carolina Mountain Club Friday Crew. The trail switchbacks sharply at <strong>0.5 mi.</strong> and levels out to provide a breather as it curves around Bearwallow's western ridge. Once on the mountain's northern slopes, climb several more sets of rock stairs at <strong>0.7 mi.</strong> At <strong>0.8 mi.</strong>, the trail emerges into Bearwallow's beautiful mountaintop meadow; in summer, you will share the grassy bald with cattle. Intersect the gravel road just beyond and walk it to its end at the summit and fire tower (N35.4610, W-82.3573) at <strong>1.0 mi.</strong> </p> <p> <strong>Alternative Routes:</strong> Hike the gravel access road to the summit (0.7 mi.), or use the trail and the road to make a loop hike (1.7 mi. round-trip).</p>"
        },
        "canecreek": {
            "name": "Cane Creek Greenway Trail",
            "id": "canecreek",
            "linkName": "Cane Creek Greenway",
            "latitude": "35.4241",
            "longitude": "-82.4999",
            "trailImage": "fletcherpark.png",
            "mapImage": "canecreekbridge.png",
            "hikeDescription": "<p>CMLC not only protects mountain lands, safeguards clean drinking water, and preserves rural farmland, we also facilitate the creation of public parks and greenspaces. During the past 10+ years, CMLC, the Town of Fletcher, private landowners, non-profit organizations, and funders worked cooperatively to create the Fletcher Community Park Greenway and continually make an effort to restore the surrounding natural areas.</p><p><strong>Rivercane Restoration:</strong> The restoration of river cane (Arundinaria gigantea), a native bamboo species, is an important aspect of the Cane Creek Greenway. It once covered stream banks throughout the southeast in large swaths called canebrakes. Such canebrakes gave Cane Creek its name, but river cane has been reduced to less than 2 percent of its range due to development, agricultural clearing and competition from exotic plant species.</p><p>Today, river cane is the primary natural material used by Cherokee artisans in traditional basket weaving, but a shortage of this once abundant resource limits the artisans’ work. Restoration projects such as this one serve the dual function of conserving native riparian ecosystems as well as traditional cultures and ways of life.</p><p><strong>A Stormwater Wetland:</strong> This site was selected for a constructed stormwater wetland because there was an existing tributary which flowed only during storms. The wetland is designed to hold water at all times and has the capacity to treat the increased volume of water from storms. It drains about 13 acres, including three acres of impervious surfaces. The stormwater wetland was constructed in the summer of 2011 and was funded by several grants awarded to the Town of Fletcher and Carolina Mountain Land Conservancy.</p>",
            "hikeChallenge": "<h3>CHALLENGE: Hike the Cane Creek Greenway</h3><strong>Primary Route:</strong> Out-and-Back greenway from Fletcher Community Park<br /><strong>Hiking Distance:</strong> 2.0 miles round-trip<br /><strong>Elevation Gain:</strong> Flat<br /><strong>Difficulty:</strong> Easy",
            "trailheadDescription": "<p><strong>Trailhead:</strong> A trail parallels the west side of the enlogated parking lot; this is the greenway. You can park anywhere and access the trail at the edge of the forest, paralleling the creek. However, you may also drive all the way to the end of the parking lot and park to access the trail near its back edge. A wooden sign marks the start of the greenway, which heads north alongside the creek and to the left of a large field.</p>",
            "hikingDirections": "<p><strong>Hiking Directions:</strong>From where you drove into the parking area, find the start of the Cane Creek Greenway just prior to the far back right edge of the paved lot. A wooden sign marks the start of the trail, however, the greenway itself parallels the entire parking area and it can be accessed at any point from the lot. Hike the gravel greenway across flat ground, paralelling Cane Creek on your right and a large grass field on your left. At almost <strong>0.2 mi.</strong>, reach a steel bridge crossing Cane Creek. Here, several interpretive signs discuss stream ecology and water quality. Cross the bridge and shortly thereafter, at <strong>0.3. mi.</strong>, arrive at a fork in the trail. The right fork proceeds several hundred yards alongside the right side of a large agricultural field and dead-ends. Take the LEFT fork, and continue walking it along level ground as it continues to parallel Cane Creek on the left. At <strong>0.6 mi.</strong>, the gravel path transitions to pavement and not far beyond, at <strong>0.7 mi.</strong>, a interpretive sign installed by CMLC on the left details the timeline of various greenway and restoration projects at Cane Creek and thanks their various partners. Immediately afterward, the greenway travels underneath a highway bridge as it crosses beneath Cane Creek Road. Another interpretive sign, again on the left, at <strong>0.9 mi.</strong>, educates about the native rivercane plant--including its historical use among the Cherokee people and the restoration efforts undertaken along Cane Creek to bring back its natural population along the creek. The greenway terminates just beyond another trail junction at <strong>1.0 mi.</strong> Picnic tables mark the junction as well as the newly installed stormwater wetland. Return to Fletcher Park the way you came.</p>"
        },
        "bridalveil": {
            "name": "Bridal Veil Falls Trail",
            "id": "bridalveil",
            "linkName": "Bridal Veil Falls",
            "latitude": "35.1609",
            "longitude": "-82.6040",
            "trailImage": "bridalveilfalls1.png",
            "mapImage": "bridalveilfalls2.png",
            "hikeDescription": "<p>DuPont State Recreational Forest is a 10,300 acre woodland wonderland bursting at its seams with spectacular waterfalls, scenic granite domes, and wild backcountry.</p><p>An outdoor enthusiast’s paradise, it offers nearly 90 miles of hiking and mountain biking trails to explore its charming beauty.  Rolling hills tucked between high mountains peaks host the headwaters of the Little River and six of western North Carolina’s most visually stunning waterfalls.</p><p>Thanks to its beauty and ample accessibility, DuPont is among the state’s premiere outdoor recreation destinations.  It forms the northern bookend of lands among a contiguous corridor of more than 23,000 acres of conserved natural lands—many within CMLC easements—along the southern Blue Ridge Escarpment.</p><p>DuPont's story represents a landmark achievement for land conservation in western North Carolina. With the help of local environmental groups, including CMLC, 7,600 acres of DuPont State Recreational Forest was purchased by the Conservation Fund and then the state of North Carolina in 1996.  Another 500 acres were purchased for addition to the State Recreational Forest in 2000.</p><p>Yet DuPont’s most remarkable natural features, its picturesque waterfalls, were nearly lost to development when a private in-holding within the greater DuPont State Recreational Forest was sold for the construction of a housing community in 1999.  A grassroots group of citizens along with local environmental groups, including CMLC, led a statewide campaign for the protection of “the heart of DuPont” and the preservation of its beautiful waterfalls.</p><p>In 2000, the state of North Carolina invoked imminent domain on the property and it was ultimately purchased with funding from the Clean Water Management Trust Fund, forever making it accessible for the public to enjoy.</p><p>Among waterfall enthusiasts, these falls consistently rank as the most visually impressive in all of North Carolina.",
            "hikeChallenge": "<h3>CHALLENGE: Hike to Bridal Veil Falls</h3><strong>Primary Route:</strong> Reasonover Creek Trail, Conservation Road, Bridal Veil Falls Road><br /><strong>Hiking Distance:</strong> 4.6 miles round-trip<br /><strong>Elevation Gain:</strong> 160 feet en route; 440 feet on the return<br /><strong>Difficulty:</strong> Moderate",
            "trailheadDescription": "<p><strong>Trailhead:</strong> DuPont State Recreational Forest's Fawn Lake Trailhead off of Reasonover Road provides a large gravel parking area.</p>",
            "hikingDirections": "<p><strong>Hiking Directions:</strong> From the parking area, locate the beginning of the Reasonover Creek Trail (signed). Hike it to a junction, at <strong>0.1 mi.</strong>, and turn left onto Conservation Road. This gravel road is a trail that will take you most of the way to Bridal Veil Falls. Begin paralleling an airplane landing strip, at <strong>1.1 mi.</strong>, on the left. At <strong>1.8 mi.</strong>, reach a junction with Bridal Veil Falls Road. Turn left and follow this trail, another gravel road, to its end at <strong>2.2 mi.</strong> A short single-track trail leads into the forest to the base of Bridal Veil Falls, reached at <strong>2.3 mi.</strong></p><p><strong>Alternative Routes:</strong> There are at least a half dozen ways to reach Bridal Veil Falls with a combination of different trails and trailheads. The falls can be reached from the High Falls parking area off of Staton Road as well as the Corn Mill Shoals parking area on Cascade Lake Road. Consult an official DuPont SRF trail map to explore the many possible routes to reach Bridal Veil Falls. Please note that many routes to Bridal Veil Falls involve wet crossings of the Little River, which may require an experience level exceeding that of many casual hikers. Choose your route carefully. The Primary Route described above does not require any treacherous water crossings.</p>"
        },
        "cedarrock": {
            "name": "Cedar Rock Trail",
            "id": "cedarrock",
            "linkName": "Cedar Rock",
            "latitude": "35.1728",
            "longitude": "-82.6387",
            "trailImage": "CedarRock.png",
            "mapImage": "CedarRockFall.png",
            "hikeDescription": "<p>DuPont State Recreational Forest is a 10,300 acre woodland wonderland bursting at its seams with spectacular waterfalls, scenic granite domes, and wild backcountry.</p><p>An outdoor enthusiast’s paradise, it offers nearly 90 miles of hiking and mountain biking trails to explore its charming beauty.  Rolling hills tucked between high mountains peaks host the headwaters of the Little River and six of western North Carolina’s most visually stunning waterfalls.</p><p>Thanks to its beauty and ample accessibility, DuPont is among the state’s premiere outdoor recreation destinations.  It forms the northern bookend of lands among a contiguous corridor of more than 23,000 acres of conserved natural lands—many within CMLC easements—along the southern Blue Ridge Escarpment.</p><p>DuPont's story represents a landmark achievement for land conservation in western North Carolina. With the help of local environmental groups, including CMLC, 7,600 acres of DuPont State Recreational Forest was purchased by the Conservation Fund and then the state of North Carolina in 1996.  Another 500 acres were purchased for addition to the State Recreational Forest in 2000.</p><p>Among waterfall enthusiasts, these falls consistently rank as the most visually impressive in all of North Carolina.</p>",
            "hikeChallenge": "<h3> CHALLENGE: Hike to Cedar Rock</h3><strong>Primary Route:</strong> Out and back hike from Hooker Falls parking area using Hooker Falls Road, Triple Falls Trail, and High Falls Trail to reach all three waterfalls<br /><strong>Hiking Distance:</strong> 2.0 miles<br /><strong>Elevation Gain:</strong> 400 feet<br /><strong>Difficulty:</strong> Moderate",
            "trailheadDescription": "<p><strong>Trailhead:</strong> The Corn Mill Shoals Trailhead provides a large gravel parking area for vehicles. The Corn Mill Shoals Trail begins on the opposite side of Cascade Lake Road.</p>",
            "hikingDirections": "<p><strong>Hiking Directions:</strong> To hike to Cedar Rock, cross to the opposite side of the paved road (Cascade Lake Road) and follow the Corn Mill Shoals Trail along a dirt roadbed. Pass a gate and an intersection with the Longside Trail on the left. Continue ahead until reaching a signed junction with the Big Rock Trail at <strong>0.1 mi.</strong> Turn left and climb this trail steeplyuntil reaching a small gap at <strong>0.5 mi.</strong> The climb resumes, though more moderate than the intial ascent, and reaches a clearing with multiple rock slabs exposed on the ground. Proceed uphill further until an expansive view becomes available on your left at <strong>1.0 mi.</strong> This is Cedar Rock, and the dramatic view to the west includes parts of the Pisgah National Forest as well as CMLC's Rich Mountain conservation easement. Turn around and return to your vehicle the way you came, or continue another <strong>0.1 mi.</strong> uphill to reach the true summit located in the forest to the left of the trail just beyond the rocky clearing.</p><p><strong>Alternative Routes:</strong> Many possible routes exist to reach Cedar Rock, though all of them involve the Big Rock Trail. Either end of the Big Rock Trail may be accessed by a combination of different trails and routes. Consult an official DuPont SRF trail map to explore the many possible trail routes that include Cedar Rock.</p>"
        },
        "eastfork": {
            "name": "East Fork Falls Trail",
            "id": "eastfork",
            "linkName": "East Fork Falls",
            "latitude": "35.1137",
            "longitude": "-82.7477",
            "trailImage": "efhfalls1.png",
            "mapImage": "efhfalls2.png",
            "hikeDescription": "<p>At more than 8,000 acres, the East Fork Headwaters tract is the largest privately owned tract in the southern Appalachians of North Carolina.  It represents the last opportunity that will be available to conserve such a sizable and significant tract in the southern Appalachians for public ownership ever again. The tract contains the upper headwaters of the East Fork of the French Broad River, including 50 miles of high quality trout streams.  East Fork Headwaters also hosts nine miles of the Foothills Spur Trail, a branch of the esteemed 76-mile long distance Foothills Trail.</p><p>In 2009, CMLC and The Conservation Fund completed the first acquisition of land within the East Fork Headwaters: a 786 acre tract that surrounds the nine mile stretch of Foothills Spur Trail.</p>",
            "hikeChallenge": "<h3>CHALLENGE: Hike to East Fork Falls</h3><strong>Primary Route:</strong> Roadside trail to base of waterfall.<br /><strong>Hiking Distance:</strong> 0.1 miles round-trip<br /><strong>Elevation Gain:</strong> 20 feet, on the return trip",
            "trailheadDescription": "<p><strong>Trailhead:</strong> The trailhead is located off of East Fork Road southwest of Brevard. The trailhead is not signed, but marked by a very small and UNSIGNED gravel pulloff on the west side of the road. A blue trash can set back in the woods is a landmark sometimes visible from the road.</p>",
            "hikingDirections": "<p><strong>Hiking Directions:</strong> Follow the obvious trail into the woods and downhill slightly to its end at the base of East Fork Falls at <strong>0.1 mi.</strong></p><p>Note that the final few yards of this trail are eroded and very slick with tricky footing. Use special care while approaching the base of the falls, especially when the ground is wet.</p><p>Also note that this trailhead and trail are on private property. CMLC Hiking Challengers have permission to park and hike to this waterfall. Please be respectful of private property.</p>"
        },
        "rattlesnake": {
            "name": "Rattlesnake Rock Trail",
            "id": "rattlesnake",
            "linkName": "Rattlesnake Rock",
            "latitude": "35.4734",
            "longitude": "-82.3320",
            "trailImage": "florencevista.png",
            "mapImage": "florencemap.png",
            "hikeDescription": "<p>Florence Nature Preserve is comprised of 600 forested acres on the southern slopes of Little Pisgah Mountain.  Forming part of the high basin of the Upper Hickory Nut Gorge, Florence’s tributaries to Hickory Creek are part of the headwaters of the Broad River.  Donated to CMLC by Dr. and Mrs. Florence in 1996, the Preserve boasts more than five miles of hiking trails that feature scenic rock outcroppings, pristine cascades, and old-growth forest.</p>",
            "hikeChallenge": "<h3>CHALLENGE: Hike to Rattlesnake Rock</h3><strong>Primary Route:</strong> Hike from the newly opened Florence Preserve trailhead on US74A to the intersection with the Blue Trail, then to the Orange Trail and to its end at Little Pisgah Point rock overlook<br /><strong>Hiking Distance:</strong> 4.2 mi.<br /><strong>Elevation Gain:</strong> 840 feet<br /><strong>Difficulty:</strong> Strenuous",
            "trailheadDescription": "<p><strong>Trailhead:</strong> The grassy parking area is most recognizable by a rock wall and stone chimney.  Park here, making sure to leave space for other vehicles. The trail begins to the left of the chimney at the far end of the rock wall.</p>",
            "hikingDirections": "<p><strong>Hiking Directions:</strong> Climb the stairs on the left side of the rock wall and walk to the back of the stone chimney. The trail climbs steeply uphill, passing an old, dilapidated barn on the right at <strong>0.2 mi.</strong> The path reaches a fork at <strong>0.3 mi.</strong>; to the right, the Hickory Nut Gorge Trail leads to private property. Please respect private property and avoid using this trail. Take the left fork and enjoy a trail with a much more reasonable grade as it contours around the southern slopes of Burntshirt Mountain.  Much of this trail follows an old logging road that makes for pleasant walking. Rockhop over a small creek, an upper tributary of the Middle Fork of Hickory Creek, at <strong>0.7 mi.</strong>, and immediately intersect the Blue Trail. Turn right on the Blue Trail and follow it gradually uphill as it parallels the stream.</p><p>At <strong>1.1 mi.</strong>, reach a junction with the Yellow Trail. Turn left on this trail and ascend it through a mountain laurel and rhododendron tunnel. At <strong>1.3 mi.</strong>, reach an intersection with the White Trail. Turn left and hike the level roadbed briefly until arriving at yet another junction at <strong>1.4 mi.</strong> Here, the Red Trail and White Trail meet at a four-way intersection. Turn left on the Red Trail and descend it until reaching an intersection with the Orange Trail at <strong>2.2 mi.</strong> Turn left and ascend the Orange Trail to reach Rattlesnake Rock at <strong>2.3 mi.</strong> An excellent vista is available to the west, with Hickory Nut Gap framed in its center. Return the way you came for a round-trip hike of <strong>4.6 mi.</strong>, or shorten your return and avoid reclimbing the Red Trail by returning to the Red & Orange Trail junction and turning left on the Red Trail. Descend the Red Trail steeply <strong>0.4 mi.</strong> to its terminus at a dirt road near the southern border of the Florence Nature Preserve. Turn left onto the dirt road and hike it <strong>0.4 mi.</strong> until reaching the old trailhead for the Blue Trail on the left. Hike the Blue Trail uphill <strong>0.3 mi.</strong> to arrive again at the intersection with the Yellow Trail. Turn right on the Yellow Trail and descend it <strong>0.7 mi.</strong> back to your vehicle--for a roundtrip hike of <strong>4.2 mi.</strong></p>"
        },
        "turkeypen": {
            "name": "Turkeypen and South Mills River Loop Trail",
            "id": "turkeypen",
            "linkName": "Template",
            "latitude": "35.3426",
            "longitude": "-82.6590",
            "trailImage": "MillsRiverweb1.png",
            "mapImage": "MillsRiverweb2.png",
            "hikeDescription": "<p>Actively protecting both land and water in the Mills River watershed has been one of CMLC’s highest priorities since our very beginning.  In 1994, John P. Humphrey donated CMLC’s first ever conservation easement on his 180 acre farm on Foster Creek, a tributary of the North Mills River and host of a rare mountain bog.</p><p>CMLC has strived to conserve land and protect water quality in the Mills River watershed ever since, completing projects that protect nearly 750 acres on portions of Seniard Creek, Queen Creek, McCall Branch and Rock Creek.  We also carried out easements that protect riparian buffers where the North and South Forks join to form the Mills River itself as well as the confluence of the Mills River and French Broad River.  Our land protection work in the South Mills River watershed directly safeguards drinking water quality for tens of thousands of Henderson County residents.</p>",
            "hikeChallenge": "<h3>CHALLENGE: Hike the Turkeypen & South Mills River Loop in Pisgah National Forest</h3><strong>Primary Route:</strong> Turkeypen, Wagon Road Gap, and South Mills River Trails<br /><strong>Hiking Distance:</strong> 6.4 miles round-trip</br /><strong>Elevation Gain:</strong>  1,240 feet<br /><strong>Difficulty:</strong> Very Strenuous",
            "trailheadDescription": "<p><strong>Trailhead:</strong> A large gravel parking area at the end of the bumpy gravel road provides parking for vehicles.</p>",
            "hikingDirections": "<p><strong>Hiking Directions:</strong> Three trails leave the Turkeypen parking area. Locate the Turkeypen Trail on the left side (west) of the lot. Ascend a set of log stairs and climb steeply through a laurel tunnel to reach the ridgecrest at <strong>0.3 mi.</strong> The climb is followed by a pleasant ridge walk. A slight descent reaches Simpson Gap at <strong>0.9 mi.</strong> The trail continues along the crest of the ridge, climbing slightly. At <strong>1.1 mi.</strong>, the trail ascends steeply and dramatically. You'll be huffing and puffing on this climb; be glad that this ascent comes early; the second half of the hike is significantly easier and more scenic. Hang in there.</p><p>At <strong>1.6 mi.</strong>, reached the top of the climb at the summit of Sharpy Mountain. Consider a well earned rest break here. The trail descends steeply beyond the summit, again staying on the ridge. Reach Sandy Gap at <strong>2.2 mi.</strong> A continuous, moderate ascent--which seems easy compared to that climb up Sharpy Mountain--traverses the ridgeline until reaching Wagon Road Gap at <strong>2.7 mi.</strong> The gap hosts a trail intersection; turn right onto the Wagon Road Gap Trail and begins its steep descent. Rock hops across several small streams and pass through a campsite at <strong>3.2 mi.</strong> Here the trail levels out and not far beyond, passes through another campsite--this one larger--at <strong>3.4 mi.</strong> A downed tree blocking the trail makes staying on the correct route a bit confusing here. Follow a faint trail directly through the center of the campground, then veering left to go around the large blowdown. Not far beyond, reach the edge of the South Mills River and junction with the South Mills River Trail. Turn right and follow this wider path to a crossing of the river via a suspension bridge at <strong>3.5 mi.</strong></p><p>Now on the north side of the river, turn right and follow a pleasant grade on an old roadbed with constant views, of the South Mills River, <strong>2.3 mi.</strong>--passing multiple campsites and several trail junctions--to a junction marked by a sign reading FOOT BRIDGE on the right at <strong>5.8 mi.</strong> Turn right and follow the path several yards until reaching another wooden suspension crossing the South Mills River once again. Once on the far side of the river, turn right and ascend an eroded trail steeply to return back to the Turkeypen parking area at <strong>6.4 mi.</strong> Celebrate; you just completed the most difficult hike of the CMLC Hiking Challenge 2.0!</p>"
        },
        "worldsedge": {
            "name": "Worlds Edge Trail",
            "id": "worldsedge",
            "linkName": "Worlds Edge -- Chimney Rock SP",
            "latitude": "35.3924",
            "longitude": "-82.2619",
            "trailImage": "WorldsEdge.png",
            "mapImage": "WorldsEdge.png",
            "hikeDescription": "<p>Watch the remarkable story of how CMLC and one small group of dedicated residents rallied for the permanent conservation the 1,568 acre tract known as Worlds Edge --the first tract of land acquired to establish what has since become Chimney Rock State Park.</p>",
            "hikeChallenge": "<h3>CHALLENGE: Hike to Worlds Edge</h3><strong>Primary Route:</strong> Old roadbed at the end of Worlds Edge Road<br /><strong>Hiking Distance:</strong> 1.5 miles round-trip<br /><strong>Elevation Gain:</strong> 160 feet, all on the return hike<br /><strong>Difficulty:</strong> Easy",
            "trailheadDescription": "<p><strong>Trailhead:</strong> Need more description.</p>",
            "hikingDirections": "<p><strong>Hiking Directions:</strong> At the end of Sugarloaf Mountain Road, park on the side of the road making sure not to block the gate straight ahead or the road on the right. The wide cul-de-sac provides plenty of places on its periphery to pull off the road and park. Locate the dirt roadbed leading straight ahead where the pavement ends. Follow this road, almost immediately reaching a gate signed for Chimney Rock State Park. While the sign indicates that pedestrians are welcome, the road just beyond the gate enters private property. CMLC Hiking Challengers have permission from the landowner to cross this private tract--which extends for the next 200 yards. At <strong>0.2 mi.</strong>, reach a loop in the road; veer right to arrive at the first overlook at Worlds Edge. Enjoy the view looking out across the North Carolina piedmont plateau. Back several paces from the overlook, find the dirt road at it continues east along the ridgeline. Hike this roadbed another <strong>0.6 mi.</strong>, passing multiple rocky overlooks--each with panoramic views. The road descends slightly to reach Chinquapin Gap at <strong>0.8 mi.</strong> Turn around here and return the way you came to your vehicle. To complete this hike's challenge, your turnaround point isn't specific. Simply hike along the rocky ridgeline known as Worlds Edge until you feel satisfied with its many vistas. The further you hike along the ridge, the more views that await you.Return to the trailhead the way that you came.</p>"
        }
    }
}
